app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(post_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-11-29 23:47:59.717051"], ["updated_at", "2018-11-29 23:47:59.717051"]]

  def update
    @school_class = SchoolClass.find_by_id(params[:id])
    @school_class.update(post_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-11-29 23:52:20.196880"], ["id", 1]]